ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/UC4_UART_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="UC4_UART" HW_revision="1.0">
    <register id="UC4_UART_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock
Division factor
0 : DIV_BY_1
1 : DIV_BY_2
....
63: DIV_BY_64" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
            <bitenum id="DIV_BY_61" value="0x3C" description="Divide clock source by 61"/>
            <bitenum id="DIV_BY_62" value="0x3D" description="Divide clock source by 62"/>
            <bitenum id="DIV_BY_63" value="0x3E" description="Divide clock source by 63"/>
            <bitenum id="DIV_BY_64" value="0x3F" description="Divide clock source by 64"/>
        </bitfield>
    </register>
    <register id="UC4_UART_CLKSEL" width="32" offset="0x1008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="MFCLK_SEL" description="Selects MFCLK as clock source if enabled" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="BUSCLK_SEL" description="Selects BUS CLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="UC4_UART_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DEPRECATED" value="0x0" description="Not supported"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="UC4_UART_CPU_INT" name="UC4_UART_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="UC4_UART_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTFG" value="0x1" description="UART receive time-out interrupt; Interrupt Flag: RT; Interrupt Priority: Highest"/>
                <bitenum id="FEFG" value="0x2" description="UART framing error interrupt; Interrupt Flag: FE"/>
                <bitenum id="PEFG" value="0x3" description="UART parity error interrupt; Interrupt Flag: PE"/>
                <bitenum id="BEFG" value="0x4" description="UART break error interrupt; Interrupt Flag: BE"/>
                <bitenum id="OEFG" value="0x5" description="UART receive overrun error interrupt; Interrupt Flag: OE"/>
                <bitenum id="RXNE" value="0x6" description="Negative edge on UARTxRXD interrupt; Interrupt Flag: RXNE"/>
                <bitenum id="RXPE" value="0x7" description="Positive edge on UARTxRXD interrupt; Interrupt Flag: RXPE"/>
                <bitenum id="LINC0" value="0x8" description="LIN capture 0 / match interrupt; Interrupt Flag: LINC0"/>
                <bitenum id="LINC1" value="0x9" description="LIN capture 1 interrupt; Interrupt Flag: LINC1"/>
                <bitenum id="LINOVF" value="0xA" description="LIN hardware counter overflow interrupt; Interrupt Flag: LINOVF"/>
                <bitenum id="RXIFG" value="0xB" description="UART receive interrupt; Interrupt Flag: RX"/>
                <bitenum id="TXIFG" value="0xC" description="UART transmit interrupt; Interrupt Flag: TX"/>
                <bitenum id="EOT" value="0xD" description="UART end of transmission interrupt (transmit serializer empty); Interrupt Flag: EOT"/>
                <bitenum id="ADDR_MATCH" value="0xE" description="9-bit mode address match interrupt; Interrupt Flag: ADDR_MATCH"/>
                <bitenum id="CTS" value="0xF" description="UART Clear to Send Modem interrupt; Interrupt Flag: CTS"/>
                <bitenum id="DMA_DONE_RX" value="0x10" description="DMA DONE on RX"/>
                <bitenum id="DMA_DONE_TX" value="0x11" description="DMA DONE on TX"/>
                <bitenum id="NERR_EVT" value="0x12" description="Noise Error Event"/>
                <bitenum id="DMA_PREIRQ_RX" value="0x13" description="DMA PRE IRQ INTERRUPT"/>
                <bitenum id="DMA_PREIRQ_TX" value="0x14" description="DMA PRE IRQ INTERRUPT"/>
                <bitenum id="LTFG" value="0x15" description="UART line time-out interrupt; Interrupt Flag"/>
            </bitfield>
        </register>
