ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/UC4_UART_1.0.xml
        </group>
    <group id="UC4_UART_DMA_TRIG_RX" name="UC4_UART_DMA_TRIG_RX" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="UC4_UART_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RTOUT" description="Enable UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXINT" description="Enable UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RTOUT" description="UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXINT" description="UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RTOUT" description="Masked UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXINT" description="Masked UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RTOUT" description="Set UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RXINT" description="Set UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <group id="UC4_UART_DMA_TRIG_TX" name="UC4_UART_DMA_TRIG_TX" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UC4_UART_DMA_TRIG_TX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXINT" description="Enable UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_TX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXINT" description="UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_TX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXINT" description="Masked UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC4_UART_DMA_TRIG_TX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXINT" description="Set UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <register id="UC4_UART_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="UC4_UART_CTL0" width="32" offset="0x1100" description="UART Control Register 0">
        <bitfield id="ENABLE" description="UART Module Enable.  If the UART is disabled in the middle of transmission or reception, it completes the current character before stopping. 
If the ENABLE bit is not set, all registers can still be accessed and updated. It is recommended to setup and change the UART operation mode with having the ENABLE bit cleared to avoid unpredictable behavior during the setup or update.
If disabled the UART module will not send or receive any data and the logic is held in reset state." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Module"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module"/>
        </bitfield>
        <bitfield id="HSE" description="High-Speed Bit Oversampling Enable   #b#NOTE:#/b# The bit oversampling influences the UART baud-rate configuration.  The state of this bit has no effect on clock generation in ISO7816 smart card mode (the SMART bit is set)." begin="16" end="15" width="2" rwaccess="R/W">
            <bitenum id="OVS16" value="0x0" description="16x oversampling."/>
            <bitenum id="OVS8" value="0x1" description="8x oversampling."/>
            <bitenum id="OVS3" value="0x2" description="3x oversampling. IrDA, Manchester and DALI not supported when 3x oversampling is enabled."/>
        </bitfield>
        <bitfield id="LBE" description="UART Loop Back Enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation."/>
            <bitenum id="ENABLE" value="0x1" description="The UARTxTX path is fed through the UARTxRX path internally."/>
        </bitfield>
        <bitfield id="RXE" description="UART Receive Enable  If the UART is disabled in the middle of a receive, it completes the current character before stopping.   #b#NOTE:#/b# To enable reception, the UARTEN bit must be set." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The receive section of the UART is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The receive section of the UART is enabled."/>
        </bitfield>
        <bitfield id="TXE" description="UART Transmit Enable  If the UART is disabled in the middle of a transmission, it completes the current character before stopping.   #b#NOTE:#/b# To enable transmission, the UARTEN bit must be set." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The transmit section of the UART is disabled. The UARTxTXD pin of the UART can be controlled by the TXD_CTL bit when enabled."/>
            <bitenum id="ENABLE" value="0x1" description="The transmit section of the UART is enabled."/>
        </bitfield>
        <bitfield id="RTS" description="Request to Send   
If RTSEN is set the RTS output signals is controlled by the hardware logic using the FIFO fill level or buffer status. 
If RTSEN is cleared the RTS output is controlled by the RTS bit. The bit is the complement of the UART request to send, RTS modem status output." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Signal not RTS"/>
            <bitenum id="SET" value="0x1" description="Signal RTS"/>
        </bitfield>
        <bitfield id="RTSEN" description="Enable hardware controlled Request to Send" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="RTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="RTS hardware flow control is enabled. Data is only requested (by asserting UARTxRTS) when the receive FIFO/buffer has available entries."/>
        </bitfield>
        <bitfield id="CTSEN" description="Enable Clear To Send" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="CTS hardware flow control is enabled. Data is only transmitted when the UARTxCTS signal is asserted."/>
        </bitfield>
        <bitfield id="MENC" description="Manchester Encode enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Manchester Encoding"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Manchester Encoding"/>
        </bitfield>
        <bitfield id="MODE" description="Set the communication mode and protocol used.
(Not defined settings uses the default setting: 0)" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Normal operation"/>
            <bitenum id="RS485" value="0x1" description="RS485 mode: UART needs to be IDLE with receiving data for the in EXTDIR_HOLD set time. EXTDIR_SETUP defines the time the RTS line is set to high before sending. When the buffer is empty the RTS line is set low again. A transmit will be delayed as long the UART is receiving data."/>
            <bitenum id="IDLELINE" value="0x2" description="The UART operates in IDLE Line Mode"/>
            <bitenum id="ADDR9BIT" value="0x3" description="The UART operates in 9 Bit Address mode"/>
            <bitenum id="SMART" value="0x4" description="ISO7816 Smart Card Support  The application must ensure that it sets 8-bit word length (WLEN set to 3h) and even parity (PEN set to 1, EPS set to 1, SPS set to 0) in UARTLCRH when using ISO7816 mode. The value of the STP2 bit in UARTLCRH is ignored and the number of stop bits is forced to 2."/>
            <bitenum id="DALI" value="0x5" description="DALI Mode:"/>
        </bitfield>
        <bitfield id="TXD_OUT" description="TXD Pin Control Controls the TXD pin when TXD_OUT_EN = 1 and TXE = 0." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="TXD pin is low"/>
            <bitenum id="HIGH" value="0x1" description="TXD pin is high"/>
        </bitfield>
        <bitfield id="TXD_OUT_EN" description="TXD Pin Control Enable. When the transmit section of the UART is disabled (TXE = 0), the TXD pin can be controlled by the TXD_OUT bit." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="TXD pin can not be controlled by TXD_OUT"/>
            <bitenum id="ENABLE" value="0x1" description="TXD pin can be controlled by TXD_OUT"/>
        </bitfield>
        <bitfield id="MAJVOTE" description="Majority Vote Enable 
When Majority Voting is enabled, the three center bits are used to determine received sample value. In case of error (i.e. all 3 bits are not the same), noise error is detected and bits RIS.NERR and register RXDATA.NERR are set.
     Oversampling of 16 : bits 7, 8, 9 are used
     Oversampling of 8 : bits 3, 4, 5 are used
Disabled : Single sample value (center value) used" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Majority voting is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Majority voting is enabled"/>
        </bitfield>
        <bitfield id="MSBFIRST" description="Most Significant Bit First
This bit has effect both on the way protocol byte is transmitted and received.
Notes: User needs to match the protocol to the correct value of this bit to send MSb or LSb first. The hardware engine will send the byte entirely based on this bit." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Least significant bit is sent first in the protocol packet"/>
            <bitenum id="ENABLE" value="0x1" description="Most significant bit is sent first in the protocol packet"/>
        </bitfield>
    </register>
    <register id="UC4_UART_LCRH" width="32" offset="0x1104" description="UART Line Control Register">
        <bitfield id="BRK" description="UART Send Break (for LIN Protocol)
1. Break condition is sent on the line for as long as this bit is set" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation"/>
            <bitenum id="ENABLE" value="0x1" description="A low level is continually output on the UARTxTXD signal, after completing transmission of the current character. For the proper execution of the break command, software must set this bit for at least two frames (character periods)."/>
        </bitfield>
        <bitfield id="PEN" description="UART Parity Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Parity is disabled and no parity bit is added to the data frame."/>
            <bitenum id="ENABLE" value="0x1" description="Parity checking and generation is enabled."/>
        </bitfield>
        <bitfield id="EPS" description="UART Even Parity Select  This bit has no effect when parity is disabled by the PEN bit.  For 9-Bit UART Mode transmissions, this bit controls the address byte and data byte indication (9th bit). 0 = The transferred byte is a data byte 1 = The transferred byte is an address byte" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ODD" value="0x0" description="Odd parity is performed, which checks for an odd number of 1s."/>
            <bitenum id="EVEN" value="0x1" description="Even parity generation and checking is performed during transmission and reception, which checks for an even number of 1s in data and parity bits."/>
        </bitfield>
        <bitfield id="STP2" description="UART Two Stop Bits Select     When in 7816 smart card mode (the SMART bit is set in the UARTCTL register), the number of stop bits is forced to 2." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="One stop bit is transmitted at the end of a frame."/>
            <bitenum id="ENABLE" value="0x1" description="Two stop bits are transmitted at the end of a frame. The receive logic checks for two stop bits being received and provide Frame Error if either is invalid."/>
        </bitfield>
        <bitfield id="WLEN" description="UART Word Length  The bits indicate the number of data bits transmitted or received in a frame as follows:" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DATABIT5" value="0x0" description="5 bits (default)"/>
            <bitenum id="DATABIT6" value="0x1" description="6 bits"/>
            <bitenum id="DATABIT7" value="0x2" description="7 bits"/>
            <bitenum id="DATABIT8" value="0x3" description="8 bits"/>
        </bitfield>
        <bitfield id="SPS" description="UART Stick Parity Select
The Stick Parity Select (SPS) bit is used to set either a permanent '1' or a permanent '0' as parity when transmitting or receiving data. Its purpose is to typically indicate the first byte of a package or to mark an address byte, for example in a multi-drop RS-485 network.
When bits PEN, EPS, and SPS of UARTLCRH are set, the parity bit is transmitted and checked as a 0. 
When bits PEN and SPS are set and EPS is cleared, the parity bit is transmitted and checked as a 1." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Stick Parity"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Stick Parity"/>
        </bitfield>
        <bitfield id="SENDIDLE" description="UART send IDLE pattern. When this bit is set,  SENDIDLE period of 11 bit times will be sent on the TX line.  
Read STAT.SENDIDLE bit to readback current status of SENDIDLE" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation"/>
            <bitenum id="ENABLE" value="0x1" description="Send Idle Pattern"/>
        </bitfield>
        <bitfield id="EXTDIR_SETUP" description="Defines the number of UARTclk ticks the signal to control the external driver for the RS485 will be set before the START bit is send" begin="20" end="16" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="EXTDIR_HOLD" description="Defines the number of UARTclk ticks the signal to control the external driver for the RS485 will be reset after the beginning of the stop bit. (If 2 STOP bits are enabled the beginning of the 2nd STOP bit.)" begin="25" end="21" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>
    <register id="UC4_UART_STAT" width="32" offset="0x1108" description="UART Status Register">
        <bitfield id="BUSY" description="UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The UART is not busy."/>
            <bitenum id="SET" value="0x1" description="The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register."/>
        </bitfield>
        <bitfield id="TXFF" description="UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is full."/>
        </bitfield>
        <bitfield id="RXFF" description="UART Receive FIFO Full" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="UART Transmit FIFO Empty" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="CTS" description="Clear To Send" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The CTS signal is not asserted (high)."/>
            <bitenum id="SET" value="0x1" description="The CTS signal is asserted (low)."/>
        </bitfield>
        <bitfield id="IDLE" description="IDLE mode has been detected in Idleline-Multiprocessor-Mode.
The IDLE bit is used as an address tag for each block of characters. In idle-line multiprocessor format, this bit is set when a received character is an address." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE has not been detected before last received character.
(In idle-line multiprocessor mode)."/>
            <bitenum id="SET" value="0x1" description="IDLE has been detected before last received character.
(In idle-line multiprocessor mode)."/>
        </bitfield>
        <bitfield id="RXFE" description="UART Receive FIFO Empty" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="eceive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="SENDIDLE" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE condition has not yet been sent on the line"/>
            <bitenum id="SET" value="0x1" description="IDLE condition has been sent on the line"/>
        </bitfield>
    </register>
